Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The function will return -1 if no font is set, or the ID value (a positive integer) for the font resource assigned.
zh_cn: 如果没有设置字体，此函数将返回-1，或者为分配的字体资源返回ID值(一个正整数)。

source: The function will return 0 if it's not found at all, or the position of the first character of the sub-string if it is found.
zh_cn: 如果根本没有找到，此函数将返回0;如果找到了，则返回子字符串的第一个字符的位置。

source: The function will return 0 if the search string is not found, or the position of the first character of the search string if it is.
zh_cn: 如果没有找到搜索字符串，此函数将返回0；如果找到了，则返回搜索字符串的第一个字符的位置。

source: The function will return 0 if the specified animation does not exist.
zh_cn: 如果指定的动画不存在，此函数将返回0。

source: The function will return a "Pointer" (index) for the buffer which should then be used in all further calls to it.
zh_cn: 此函数将为缓冲区返回一个"指针"(索引)，然后在所有对它的后续调用中使用它。

source: The function will return a method which can be called from the variable it is assigned to (see the code example below).
zh_cn: 函数将返回一个方法，可以从赋值给它的变量调用该方法(参见下面的代码示例)。

source: The function will return a modified tile-data set which can then be applied using the tilemap_set() function.
zh_cn: 此函数将返回一个修改过的图块数据，然后可以使用tilemap_set()函数应用该数据集。

source: The function will return a new buffer ID value for the compressed buffer, or a value less than 0 if it has failed for any reason.
zh_cn: 此函数将为压缩的缓冲区返回一个新的缓冲区ID值，如果由于任何原因失败，则返回一个小于0的值。

source: The function will return a pointer to the struct and this is then used to add channels and other data to the animation curve.
zh_cn: 此函数将返回指向结构的指针，然后用于向动画曲线添加通道和其他数据。

source: The function will return a struct which will have the following member variables (note that "objects" here refers to anything that can be garbage collected and not general object instances as defined in the Asset Browser):
zh_cn: 此函数将返回一个结构，该结构将具有以下成员变量(注意，这里的"对象"指的是任何可以被垃圾收集的东西，而不是资源浏览器中定义的一般对象实例):

source: The function will return a unique ID value for the save, which can then be used in the Asynchronous Save / Load event to parse the results from the async_load DS map.
zh_cn: 此函数将为保存返回一个惟一的ID值，然后可以在异步保存/加载事件中使用它来解析来自async_load DS map的结果。

source: The function will return a unique id value that should then be used in the appropriate asynchronous event to identify the DS map that is returned as a "call back" from the cloud service.
zh_cn: 此函数将返回一个惟一的id值，然后在适当的异步事件中使用该值来标识作为云服务"回调"返回的DS map。

source: The function will return an array where each entry is the name (as a string) of the asset with the given tag.
zh_cn: 此函数将返回一个数组，其中每个条目都是带有给定标签的资源的名称(作为一个字符串)。

source: The function will return an array with 8 values per display (ie: if you have two displays, the array will have a length of 16 indices), where the values [0 ... 3] correspond to the overlapx1, overlapy1, overlapx2, overlapy2 - defining the region of overlap on this display and will be set to 0,0,0,0 if no overlap - and the values [4 ... 7] corresponds to the monitorx1, monitory1, monitorx2, monitory2 - the coordinates of the display in the virtual display space.
zh_cn: 此函数将返回一个数组，每个显示器有8个值(即:如果您有两个显示器，该数组将有16个索引的长度)，其中值[0...3]对应于overlapx1，overlapy1，overlapx2，overlapy2 -定义该显示器上的重叠区域，如果没有重叠，将被设置为0，0，0，0-以及值[4...7]对应于显示器1，显示器1，显示器2，显示器2 -显示器在虚拟显示空间中的坐标。

source: The function will return an id value which must be stored in a variable to be used in all further button functions that reference the new icon.
zh_cn: 此函数将返回一个id值，该值必须存储在一个变量中，以便在所有引用新图标的后续按钮函数中使用。

source: The function will return an array of 3 (or 4 if a w is given) elements where:
zh_cn: 此函数将返回一个包含3个元素(如果给定w则返回4个元素)的数组，其中:

source: The function will return one of the constants listed below, with the default setting being mip_markedonly.
zh_cn: 此函数将返回下面列出的常量之一，默认设置为mip_markedonly。

source: The function will return the ID value associated with that sprite element on the layer.
zh_cn: 此函数将返回与该层上的精灵元素相关的ID值。

source: The function will return the index value for the new emitter which must be stored in a variable and used in all further functions that reference the emitter, and the emitter itself must be destroyed when no longer being used to prevent memory leaks (this can be achieved using the specific emitter destroy functions or by destroying the whole particle system that the emitter belongs to).
zh_cn: 此函数将返回新发射器的索引值，该值必须存储在一个变量中，并在引用发射器的所有其他函数中使用，并且发射器本身在不再用于防止内存泄漏时必须销毁(这可以通过使用特定的发射器销毁函数或销毁发射器所属的整个粒子系统来实现)。

source: The function will return the input string, or the default value if nothing has been entered.
zh_cn: 此函数将返回输入字符串，如果没有输入任何内容，则返回默认值。

source: The function will return the new matrix index which should be stored in a variable for future use.
zh_cn: 函数将返回新的矩阵索引，该索引应存储在一个变量中以备将来使用。

source: The function will return the new randomised seed value (an unsigned 32bit integer).
zh_cn: 此函数将返回新的随机种子值(无符号32位整数)。

source: The function will return the number of bytes of data sent, or a number less than 0 if the send has failed.
zh_cn: 此函数将返回已发送数据的字节数，如果发送失败则返回小于0的数字。

source: The function will return the typed in integer, or the default value if nothing has been entered.
zh_cn: 此函数将返回键入的整数，如果没有输入任何内容，则返回默认值。

source: The function will return the unique ID of the sequence element, which can then be used in all further layer functions for sequences, or it can be used to retrieve the sequence instance struct using the function layer_sequence_get_instance().
zh_cn: 此函数将返回序列元素的唯一ID，然后可以在序列的所有其他层函数中使用该ID，或者可以使用函数layer_sequence_get_instance()来检索序列实例结构。

source: The function will return the value held by the variable or undefined if the named variable does not exist.
zh_cn: 如果指定的变量不存在，函数将返回变量所持有的值。

source: The function will return the value held by the variable, or undefined if the variable does not exist.
zh_cn: 函数将返回变量持有的值，如果变量不存在则返回undefined。

source: The function will return true if AA is enabled, and false if it is not.
zh_cn: 如果启用了AA，此函数将返回true，如果未启用则返回false。

source: The function will return true if a variable with the given name exists for the instance and false otherwise.
zh_cn: 如果实例中存在具有给定名称的变量，则此函数将返回true，否则返回false。

source: The function will return true if a variable with the given name exists for the struct and false otherwise.
zh_cn: 如果该结构存在具有给定名称的变量，则此函数将返回true，否则返回false。

source: The function will return true if it is enabled or false otherwise.
zh_cn: 如果函数被启用，则返回true，否则返回false。

source: The function will return true if it is enabled, and false otherwise and you can enable or disable tap counting using the function gesture_tap_count().
zh_cn: 如果启用，此函数将返回true，否则返回false，您可以使用函数gesture_tap_count()来启用或禁用点击计数。

source: The function will return true if it is visible and false if it is not.
zh_cn: 如果可见，函数将返回true，否则返回false。

source: The function will return true if loading is initiated and false if the group ID is invalid, or it has already been flagged for loading.
zh_cn: 如果加载被启动，此函数将返回true，如果组ID无效或已经标记为加载，则返回false。

source: The function will return true if the OS virtual keyboard is visible/being shown or false if it is hidden/hiding.
zh_cn: 如果操作系统虚拟键盘可见/显示，此函数将返回true如果隐藏，此函数将返回false。

source: The function will return true if the file has successfully been renamed, or false in any other circumstances.
zh_cn: 如果文件已成功重命名，此函数将返回true，否则返回false。

source: The function will return true if the given input is numeric, and false otherwise.
zh_cn: 如果给定的输入是数值，此函数将返回true，否则返回false。

source: The function will return true if the instance is on the layer and false if it is not.
zh_cn: 如果实例在图层上，此函数将返回true，如果不在图层上，则返回false。

source: The function will return true if the key exists and the value is replaced, and false if the key does not exist and a new key was created with the value.
zh_cn: 如果键存在且值被替换，则此函数将返回true;如果键不存在且用该值创建了一个新键，则返回false。

source: The function will return true if the tile was successfully set and false if there was an issue and it wasn't set.
zh_cn: 如果贴图设置成功，此函数将返回true，如果存在问题且未设置，则返回false。

source: The function will return true if unloading is initiated and false if the group ID is invalid, or it has already been flagged for unloading.
zh_cn: 如果开始卸载，此函数将返回true，如果组ID无效，或者已经标记为卸载，则返回false。

source: The function will return whether a path was found (true) or not (false).
zh_cn: 此函数将返回是找到路径(true)或(false)。

source: The function will return whether it has reached the goal position (true) or if it has failed (false).
zh_cn: 此函数将返回是否已到达目标位置(true)或是否已失败(false)。

source: The function will take a keycode value as returned by the function ord() (only capital letters from A-Z or numbers from 0-9), or any of the vk_* constants listed on the main Keyboard Input page.
zh_cn: 此函数将接受ord()函数返回的keycode值(只接受a - z中的大写字母或0-9中的数字)，或主键盘输入页面中列出的任何vk_*常量。

source: The function will trigger a Social Asynchronous Event where the returned async_load DS map will have the following key/value pairs:
zh_cn: 此函数将触发一个社交异步事件，其中返回的async_load DS map将具有以下键/值对:

source: The function will trigger a callback Social Asynchronous Event which contains the async_load map populated with the relevant key/value pairs.
zh_cn: 此函数将触发一个回调社会异步事件，其中包含用相关键/值对填充的async_load映射。

source: The gain value is based on a linear scale from 0 (silent) to 1 (full volume) and will affect the relative volume of all sounds and music played from within your game through that listener.
zh_cn: 增益值基于从0(静音)到1(最大音量)的线性范围，将影响游戏中通过该播放的所有声音和音乐的相对音量。

source: The gain value returned is based on a linear scale from 0 (silent) to 1 (full volume).
zh_cn: 返回的增益值基于从0(静音)到1(全音量)的线性缩放。

source: The game is loaded from a previously created "grow" buffer (see Buffers) and the buffer must have had a game state saved to it using game_save_buffer() function.
zh_cn: 游戏是从先前创建的"增长"缓冲区(参见Buffers)中加载的，并且缓冲区必须已经使用game_save_buffer()函数保存了游戏状态。

source: The game speed (as specified in the Game Options) and the fps (frames per second).
zh_cn: 游戏速度(在游戏选项中指定)和fps(每秒帧数)。

source: The gamepad's W orientation
zh_cn: 游戏手柄的W方向

source: The gamepad's X orientation
zh_cn: 游戏手柄的X方向

source: The gamepad's Y orientation
zh_cn: 游戏手柄的Y方向

source: The gamepad's Z orientation
zh_cn: 游戏手柄的Z方向

source: The gamepad's acceleration on the X axis
zh_cn: 游戏手柄在X轴上的加速度

source: The gamepad's acceleration on the Y axis
zh_cn: 游戏手柄在Y轴上的加速度

source: The gamepad's acceleration on the Z axis
zh_cn: 游戏手柄在Z轴上的加速度

source: The gamepad's angular velocity on the X axis
zh_cn: 游戏手柄在X轴上的角速度

source: The gamepad's angular velocity on the Y axis
zh_cn: 游戏手柄在Y轴上的角速度

source: The gamepad's angular velocity on the Z axis
zh_cn: 游戏手柄在Z轴上的角速度

source: The general rule of thumb is that if an instance has a lot of inertia, you will need a lot of torque to get it to start rotating.
zh_cn: 一般的经验法则是，如果一个实例有很大的惯性，你将需要很大的扭矩来让它开始旋转。

source: The given name refers to a Sequence.
zh_cn: 给定的名称引用了一个序列。

source: The given name refers to a font.
zh_cn: 给定的名称引用了一种字体。

source: The given name refers to a path.
zh_cn: 给定的名称引用了一个路径。

source: The given name refers to a room.
zh_cn: 给定的名称引用了一个房间。

source: The given name refers to a script.
zh_cn: 给定的名称引用了一个脚本。

source: The given name refers to a shader.
zh_cn: 给定的名称引用了一个着色器。

source: The given name refers to a sound.
zh_cn: 给定的名称引用了一个声音。

source: The given name refers to a sprite.
zh_cn: 给定的名称引用了一个精灵。

source: The given name refers to a tile set.
zh_cn: 给定的名称引用了一个图块集。

source: The given name refers to a time line.
zh_cn: 给定的名称引用了时间线。

source: The given name refers to an Animation Curve.
zh_cn: 给定的名称引用了动画曲线。

source: The given name refers to an asset that either does not exist, or is not one of the above listed.
zh_cn: 给定的名称指的是不存在的资源，或者不是上面列出的资源之一。

source: The given name refers to an object.
zh_cn: 给定的名称引用了一个对象。

source: The gml_pragma function affects how the given target compiles your code and should be called with the different commands to further optimise the final compilation of your project.
zh_cn: gml_pragma函数影响给定目标如何编译您的代码，应该使用不同的命令调用它，以进一步优化项目的最终编译。

source: The gravity strength value is added to the particle speed every step and is usually a small value like 0.5, while the direction is the direction of the gravity "pull" and follows the standard GameMaker directions of 0° being right, 90° being up, 180° being left and 270° being down.
zh_cn: 重力强度值会在每一步添加到粒子速度中，通常是一个很小的值，如0.5，而方向是重力"拉动"的方向，并遵循标准的GameMaker方向，即0为右，90为上，180为左，270为下。

source: The green component of the colour
zh_cn: 颜色的绿色成分

source: The group flags to set on the particle (see Description below).
zh_cn: 要在粒子上设置的组标志(请参见下面的描述)。

source: The group index (ID) is the value that is returned when you call the function physics_particle_group_end().
zh_cn: 组索引(ID)是调用函数physics_particle_group_end()时返回的值。

source: The group index (ID) of the particle group to count.
zh_cn: 要计数的粒子组的组索引(ID)。

source: The group index (ID) of the particle group to get the data from.
zh_cn: 要从中获取数据的粒子组的组索引(ID)。

source: The group index (its ID) is that which was returned by the function physics_particle_group_end(), and the buffer used must have been created previously using the function buffer_create().
zh_cn: 组索引(其ID)是由函数physics_particle_group_end()返回的，并且所使用的缓冲区必须是先前使用函数buffer_create()创建的。

source: The group index is the value returned when you created the group using the function audio_create_sync_group(), and the return value is the time in seconds that the tracks have been playing.
zh_cn: 组索引是当您使用函数audio_create_sync_group()创建组时返回的值，返回值是轨道已经播放的时间(以秒为单位)。

source: The group index is the value returned when you created the group using the function audio_create_sync_group(), and the sound index is the index of any compressed sound (*.ogg or *.mp3) from the Asset Browser.
zh_cn: 组索引是使用函数audio_create_sync_group()创建组时返回的值，声音索引是任何压缩声音(*.)的索引。ogg或*.mp3)。

source: The group index is the value returned when you created the group using the function audio_create_sync_group().
zh_cn: 组索引是使用函数audio_create_sync_group()创建组时返回的值。

source: The group index to assign the sound to.
zh_cn: 将声音分配到的组索引。

source: The group index to be destroyed.
zh_cn: 要销毁的组索引。

source: The group index to check.
zh_cn: 要检查的组索引。

source: The group index to debug, or -1 to switch off the debugging.
zh_cn: 要调试的组索引，或-1关闭调试。

source: The group index to get the position of.
zh_cn: 要获取其位置的组索引。

source: The group index to pause.
zh_cn: 要暂停的组的索引。

source: The group index to play.
zh_cn: 要播放的组索引。

source: The group index to resume.
zh_cn: 要恢复的组索引。

source: The group index to stop playing.
zh_cn: 群组索引停止播放。

source: The group value is that which was returned when you created the group of particles using the function physics_particle_group_end(), and the function will return a value which is the combined value of the currently set flags.
zh_cn: 组值是使用函数physics_particle_group_end()创建粒子组时返回的值，此函数将返回当前设置标志的组合值。

source: The group value is that which was returned when you created the group of particles using the function physics_particle_group_end(), while the flags are the return value of a combination of the following constants:
zh_cn: 组值是使用函数physics_particle_group_end()创建粒子组时返回的值，而标志是以下常量组合的返回值:

source: The groups should have been created with over-lapping edges, as, if they are not already touching, they will not be joined.
zh_cn: 这些组应该是用重叠的边创建的，因为如果它们还没有接触，它们就不会被连接。

source: The half height of the box.
zh_cn: 盒子的半高。

source: The half height of the rectangle.
zh_cn: 矩形的半高。

source: The half width of the box.
zh_cn: 盒子的半宽。

source: The half width of the rectangle.
zh_cn: 矩形的半宽。

source: The halfway point alpha of the particle.
zh_cn: 粒子的中间alpha。

source: The handle of the call to cancel
zh_cn: 取消调用的句柄

source: The handle of the shader constant to set.
zh_cn: 要设置的着色器常量的句柄。

source: The height (in pixels) of each individual cell of the mp_grid
zh_cn: mp_grid中每个单元格的高度(以像素为单位)

source: The height (in pixels) of the view port
zh_cn: 视口的高度(以像素为单位)

source: The height at which to draw the surface.
zh_cn: 绘制表面的高度。

source: The height of the GUI
zh_cn: GUI的高度

source: The height of the area in the source surface to copy from.
zh_cn: 源表面中要复制的区域的高度。

source: The height of the area of the screen to capture
zh_cn: 要捕获的屏幕区域的高度

source: The height of the area the stretched sprite will occupy.
zh_cn: 被拉伸的精灵将占据的区域的高度。

source: The height of the area the view captures.
zh_cn: 视图捕获的区域的高度。

source: The height of the area to be copied (from the y position).
zh_cn: 要复制的区域的高度(从y位置开始)。

source: The height of the area to draw.
zh_cn: 要绘制区域的高度。

source: The height of the camera view in pixels
zh_cn: 相机视图的高度，以像素为单位

source: The height of the gif to create
zh_cn: 要创建的gif的高度

source: The height of the grid to be created.
zh_cn: 要创建的网格的高度。

source: The height of the new surface.
zh_cn: 新表面的高度。

source: The height of the part to be draw, from top.
zh_cn: 要绘制的部分的高度，从顶部算起。

source: The height of the part to be drawn, from top.
zh_cn: 要绘制的部分的高度，从顶部算起。

source: The height of the part to save.
zh_cn: 要保存的部件的高度。

source: The height of the projection at the near Z position.
zh_cn: 投影在Z位置附近的高度。

source: The height of the projection.
zh_cn: 投影的高度。

source: The height of the region to activate.
zh_cn: 要激活区域的高度。

source: The height of the region to deactivate.
zh_cn: 要停用区域的高度。

source: The height of the surface to be created.
zh_cn: 要创建的表面的高度。

source: The height of the tile map (in cells)
zh_cn: tile map高度(以单元格为单位)

source: The height of the view port (or combined view ports if more than one are active) define the height of the game window or background canvas at the start of the game, so changing this value after the game has started will have no visible effect on the game window size unless called along with the function window_set_size().
zh_cn: 视口(或组合视口，如果不止一个处于活动状态)的高度定义了游戏开始时游戏窗口或背景画布的高度，因此在游戏开始后更改该值不会对游戏窗口大小产生明显影响，除非与函数window_set_size()一起调用。

source: The height of the virtual key
zh_cn: 虚拟键的高度

source: The height value (in "cells")
zh_cn: 高度值(单位为"格")

source: The high end of the range from which the random number will be selected.
zh_cn: 将从中选择随机数的范围的上限。

source: The horizontal and vertical speed.
zh_cn: 水平和垂直速度。

source: The horizontal scale (default 1).
zh_cn: 水平缩放(默认为1)。

source: The horizontal scale.
zh_cn: 横向缩放。

source: The horizontal scaling factor (use -1 to reset to default).
zh_cn: 水平缩放系数(使用-1重置为默认值)。

source: The horizontal scaling of the base particle.
zh_cn: 基本粒子的水平缩放。

source: The horizontal scaling of the image, as a multiplier: 1 = normal scaling, 0.5 is half etc...
zh_cn: 图像的横向缩放，作为乘数: 1 = 正常缩放，0.5是一半，以此类推...

source: The horizontal scaling of the sprite, as a multiplier: 1 = normal scaling, 0.5 is half etc...
zh_cn: 精灵的水平缩放，作为一个乘数:1 =正常缩放，0.5是一半等等……

source: The horizontal scaling of the sprite.
zh_cn: 精灵的水平缩放。

source: The horizontal scaling of the surface.
zh_cn: 表面的水平缩放。

source: The horizontal scaling the part should be drawn with.
zh_cn: 绘制部分时应采用的水平缩放。

source: The horizontal scaling to draw the surface with.
zh_cn: 绘制表面时使用的横向缩放。

source: The horizontal snapping (the size in pixels between 'cells').
zh_cn: 水平对齐("单元格"之间的像素大小)。

source: The horizontal snapping to check.
zh_cn: 要检查的水平对齐。

source: The horizontal speed (in pixels per game frame) to set
zh_cn: 要设置的水平速度(以每帧游戏像素为单位)

source: The horizontal tiling toggle, which can be true or false
zh_cn: 水平平铺切换，可为 true 或 false

source: The hour to check.
zh_cn: 要检查的时间。

source: The hour to set.
zh_cn: 要设置的小时。

source: The hue of the colour
zh_cn: 颜色的色调

source: The id is also returned (and can be stored in a variable) when an instance is created using instance_create_layer() or instance_create_depth(), as well as other instance functions.
zh_cn: 当使用instance_create_layer()或instance_create_depth()以及其他实例函数创建实例时，id也会返回(并且可以存储在变量中)。

source: The id key of this DS Map is used to identify the correct callback (there can be more than one trigger function for any given asynchronous event), and will be paired with the constant achievement_achievement_info as well as a number of other key/value pairs for each player.
zh_cn: 这个DS Map的id键用于标识正确的回调(对于任何给定的异步事件，可以有多个触发函数)，并且将与常量achievement_achievement_info以及每个玩家的许多其他键/值对配对。

source: The id key of this DS Map is used to identify the correct callback (there can be more than one trigger function for any given asynchronous event), and will be paired with the constant achievement_challenge_list_received as well as a number of other key/value pairs for each challenge.
zh_cn: 这个DS Map的id键用于识别正确的回调(对于任何给定的异步事件都可以有多个触发器函数)，并将与常量achievement_challenge_list_received以及针对每个挑战的许多其他键/值对配对。

source: The id key of this DS Map is used to identify the correct callback (there can be more than one trigger function for any given asynchronous event), and will be paired with the constant achievement_friends_info as well as a number of other key/value pairs for each friend.
zh_cn: 这个DS Map的id键用于识别正确的回调(对于任何给定的异步事件都可以有多个触发器函数)，并将与常量achievement_friends_info以及每个好友的许多其他键/值对配对。

source: The id key of this DS Map is used to identify the correct callback (there can be more than one trigger function for any given asynchronous event), and will be paired with the constant achievement_our_info as well as a number of other key/value pairs for each challenge.
zh_cn: 这个DS Map的id键用于识别正确的回调(对于任何给定的异步事件都可以有多个触发器函数)，并将与常量achievement_our_info以及针对每个挑战的许多其他键/值对配对。

source: The id key of this DS Map is used to identify the correct callback (there can be more than one trigger function for any given asynchronous event), and will be paired with the constant achievement_pic_loaded as well as a number of other key/value pairs.
zh_cn: 这个DS Map的id键用于识别正确的回调(对于任何给定的异步事件都可以有多个触发器函数)，并将与常量achievement_pic_loaded以及许多其他键/值对配对。

source: The id of the NEW queue.
zh_cn: 新队列的id。

source: The id of the NEW stack.
zh_cn: 新堆栈的id。

source: The id of the buffer to get the data from.
zh_cn: 要从中获取数据的缓冲区的id。

source: The id of the data structure to check.
zh_cn: 要检查的数据结构的id。

source: The id of the data structure to clear.
zh_cn: 要清除的数据结构的id。

source: The id of the data structure to pop from.
zh_cn: 要从中弹出的数据结构的id。

source: The id of the data structure to push onto.
zh_cn: 要推入的数据结构的id。

source: The id of the data structure to read from.
zh_cn: 要读取的数据结构的id。

source: The id of the data structure to read into.
zh_cn: 要读入的数据结构的id。

source: The id of the data structure to read the string into
zh_cn: 要将字符串读入的数据结构的id

source: The id of the data structure to remove.
zh_cn: 要移除的数据结构的id。

source: The id of the data structure to use
zh_cn: 要使用的数据结构的id

source: The id of the data structure to write.
zh_cn: 要写入的数据结构的id。

source: The id of the ds_list to use to replace the one previously stored in the given key.
zh_cn: 用于替换先前存储在给定键中的ds_list的id。

source: The id of the ds_map to use to replace the one previously stored in the given key.
zh_cn: 用于替换先前存储在给定键中的ds_map的id。

source: The id of the ds_map to use.
zh_cn: 要使用的ds_map的id。

source: The id of the file to check.
zh_cn: 要检查的文件的id。

source: The id of the file to close.
zh_cn: 要关闭文件的id。

source: The id of the file to edit.
zh_cn: 要编辑的文件的id。

source: The id of the file to read from.
zh_cn: 要从中读取的文件的id。

source: The id of the list being copied to.
zh_cn: 要复制到的列表的id。

source: The id of the list to add to.
zh_cn: 要添加的列表的id。

source: The id of the list to add.
zh_cn: 要添加的列表的id。

source: The id of the list to be copied from.
zh_cn: 要复制的列表的id。

source: The id of the list to change.
zh_cn: 要更改的列表的id。

source: The id of the list to check.
zh_cn: 要检查的列表的id。

source: The id of the list to mark.
zh_cn: 要标记的列表的id。

source: The id of the list to shuffle.
zh_cn: 要打乱的列表的id。

source: The id of the list to sort.
zh_cn: 要排序列表的id。

source: The id of the list to use.
zh_cn: 要使用的列表的id。

source: The id of the map to add to.
zh_cn: 要添加到的map的id。

source: The id of the map to add.
zh_cn: 要添加的映射的id。

source: The id of the map to change.
zh_cn: 要更改的map的id。

source: The id of the map to destroy.
zh_cn: 要销毁的map的id。

source: The id of the map to use.
zh_cn: 要使用的map的id。

source: The id of the map you are copying from
zh_cn: 要从中复制的map的id

source: The id of the map you are copying to
zh_cn: 要复制到的map的id

source: The id of the person to get the image of (either from a friends list or a leaderboard)
zh_cn: 要获取图像的人的id(从好友列表或排行榜中)

source: The id of the priority queue to add to.
zh_cn: 要添加到的优先队列的id。
